tap "defanglabs/defang"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Kubernetes package manager
brew "helm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# OpenTofu / Terraform / Terragrunt / Atmos version manager
brew "tenv"
# Command-line interface for the Defang Opinionated Platform
brew "defanglabs/defang/defang"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Command-line interface for 1Password
cask "1password-cli"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Rust-based terminal
cask "warp"
